src/Catalogs/ШаблоныПечатныхДокументов/ШаблоныПечатныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПечатныхДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Групповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСтраницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРядов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьQRКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСправа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСнизу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринтерДляПерепрогона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ШаблоныПечатныхДокументов/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПоказатьШаблонНаСервере(Стр)
ТабДок.Очистить();
	Если Стр.Внешний Тогда
	Макет = Новый ТабличныйДокумент;
	
	Макет.Прочитать(Константы.КаталогДокументовИПрограмм.Получить()+"532 (Паспорта)\Шаблоны\Шаблоны1С8\"+СокрЛП(Стр.Шаблон));
	Иначе	
	Макет = ПолучитьОбщийМакет(Стр.Шаблон);
	КонецЕсли;
		Если Стр.КоличествоРядов > 1 Тогда
		ОблШаблон = Макет.ПолучитьОбласть(,1,,1);
		Иначе	
		ОблШаблон = Макет.ПолучитьОбласть(,,,);
		КонецЕсли; 
Индекс = 0;
	Для каждого Парам Из Макет.Параметры Цикл
	ОблШаблон.Параметры.Установить(Индекс,"*****");
	Индекс = Индекс + 1;
	КонецЦикла;
ТабДок.Вывести(ОблШаблон);
	Если Стр.КоличествоРядов > 1 Тогда
		Для к = 1 По Стр.КоличествоРядов-1 Цикл
		ТабДок.Присоединить(ОблШаблон);
		КонецЦикла; 
	КонецЕсли; 
ТабДок.РазмерСтраницы = Стр.РазмерСтраницы;
ТабДок.ПолеСлева = Стр.ПолеСлева;
ТабДок.ПолеСверху = Стр.ПолеСверху;
ТабДок.ПолеСнизу = Стр.ПолеСнизу;
ТабДок.ПолеСправа = Стр.ПолеСправа;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьШаблон(Команда)
ПоказатьШаблонНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры
